# <center>Laboratorium Analiza i bazy danych </center>

## <center>Łączenie tabel, podzapytania i funkcje agregujące</center>

## Przykładowe tabele obrazujące łączenie

Do zobrazowania operacji łączenia zostaną użyte tabele:

```sql
CREATE TABLE shape_a (
    id INT PRIMARY KEY,
    shape VARCHAR (100) NOT NULL
);
 
CREATE TABLE shape_b (
    id INT PRIMARY KEY,
    shape VARCHAR (100) NOT NULL
);
```
 
Polecenie CREATE TABLE tworzy tabelę o zadanej nazwie i strukturze. Ogólna postać to:
```sql
CREATE TABLE tab_name (
    col_name1 data_type constrain,
    col_name1 data_type constrain,
    ...
);
```
Należy uzupełnić ją danymi:
```sql
INSERT INTO shape_a (id, shape)
VALUES
    (1, 'Trójkąt'),
    (2, 'Kwadrat'),
    (3, 'Deltoid'),
    (4, 'Traper');
 
INSERT INTO shape_b (id, shape)
VALUES
    (1, 'Kwadrat'),
    (2, 'Trójkąt'),
    (3, 'Romb'),
    (4, 'Równoległobok');
```
Komenda INSERT INTO pozwala na dodanie do tabeli rekordów. Ogólna postać to:

```sql
INSERT INTO tab_name (col1_name, col2_name2, ...) 
VALUES
    (val1_col1, val2_col2),
    (val2_col1, val2_col2),
    ...
```

## Inner join 

Jest to podstawowy rodzaj złączenie. Ten sposób złączenia wybiera  te wiersze, dla których warunek złączenia jest spełniony. W żadnej z łączonych tabel kolumna użyta do łączenia nie może mieć wartości NULL. 

#### Przykład:
```sql
SELECT
    a.id id_a,
    a.shape shape_a,
    b.id id_b,
    b.shape shape_b
FROM
    shape_a a
INNER JOIN shape_b b ON a.shape = b.shape;
```
W zapytaniu powyżej użyto *aliasów* nazw tabel i column wynikowych, jest to szczególnie przydatne przy długich nazwach tabel i wprowadza czytelność w zapytaniu.

#### Wynik:
|id_a|shape_a|id_b|shape_b|
|-|-|-|-|
|1|Trójkąt|2|Trójkąt|
|2|Kwadrat|1|Kwadrat|

## OUTER JOIN

Istnieją trzy rodzaje złączeń OUTER:
- LEFT OUTER JOIN,
- RIGHT OUTER JOIN,
- FULL OUTER JOIN.

### LEFT OUTER JOIN

Ten rodzaj złączenie zwróci wszystkie rekordy z lewej tablicy i dopasuje do nich rekordy z prawej tablicy które spełniją zadany warunek złączenia. Jeżeli w prawej tablicy nie występują rekordy spełnijące warunek złączenia z lewą w ich miejscu pojawią się wartości NULL.

#### Przykład 1:
```sql
SELECT
    a.id id_a,
    a.shape shape_a,
    b.id id_b,
    b.shape shape_b
FROM
    shape_a a
LEFT JOIN shape_b b ON a.shape = b.shape;
```
#### Wynik:
|id_a|shape_a|id_b|shape_b|
|-|-|-|-|
|1|Trójkąt|2|Trójkąt|
|2|Kwadrat|1|Kwadrat|
|3|Deltoid|NULL|NULL|
|4|Traper|NULL|NULL|

#### Przykład 2:
```sql
SELECT
    b.id id_b,
    b.shape shape_b,
    a.id id_a,
    a.shape shape_a   
FROM
    shape_b b
LEFT JOIN shape_a a ON a.shape = b.shape;
```
#### Wynik:
|id_a|shape_a|id_b|shape_b|
|-|-|-|-|
|1|Kwadrat|2|Kwadrat|
|2|Trójkąt|1|Trójkąt|
|3|Romb|NULL|NULL|
|4|Równoległobok|NULL|NULL|

### RIGHT OUTER JOIN

Działa jak left outer join z tym, że prawa tablica w zapytaniu jest brana w całości.

#### Przykład:
```sql
SELECT
    a.id id_a,
    a.shape shape_a,
    b.id id_b,
    b.shape shape_b
FROM
    shape_a a
RIGHT JOIN shape_b b ON a.shape = b.shape;
```

#### Wynik:
|id_a|shape_a|id_b|shape_b|
|-|-|-|-|
|2|Kwadrat|1|Kwadrat|
|1|Trójkąt|2|Trójkąt|
|NULL|NULL|3|Romb|
|NULL|NULL|4|Równoległobok|


### FULL OUTER JOIN

Jest złączeniem które zwraca:
- wiersze dla których warunek złączenia jest spełniony,
- wiersze z lewej tabeli dla których nie ma odpowiedników w prawej,
- wiersze z prawej tabeli dla których nie ma odpowiedników w lewej. 

#### Przykład:
```sql
SELECT
    a.id id_a,
    a.shape shape_a,
    b.id id_b,
    b.shape shape_b
FROM
    shape_a a
FULL JOIN shape_b b ON a.shape = b.shape;
```
|id_a|shape_a|id_b|shape_b|
|-|-|-|-|
|1|Trójkąt|2|Trójkąt|
|2|Kwadrat|1|Kwadrat|
|3|Deltoid"|NULL|NULL|
|4|Traper|NULL|NULL|
|NULL|NULL|3|Romb|
|NULL|NULL|4|Równoległobok|

## Podzapytania

Podzapytanie zagnieżdżone SELECT znajduje się wewnątrz zewnętrznego zapytania SELECT, np. po klauzuli WHERE, HAVING lub FROM. W przypadku tego rodzaju zapytań w pierwszej kolejności wykonywane są wewnętrzne zapytania SELECT, a ich wynik jest wykorzystywany do zewnętrznego zapytania SELECT. Stąd łatwo zuważyć, że mogą one służyć do poprawy wydajności obsługi zapytania. Należy dobierać podzapytania tak by najbardziej zagnieżdżone podzapytanie zawierało najmniejszy zbiór poszukiwań. 

#### Przykład:
Jeżeli chcemy znaleźć w bazie informację o tytułach filmów zwróconych w zadanym okresie możemy wykonać następujące zapytanie:
```sql
SELECT
   film_id,
   title
FROM
   film
WHERE
   film_id IN (
      SELECT
         inventory.film_id
      FROM
         rental
      INNER JOIN inventory ON inventory.inventory_id = rental.inventory_id
      WHERE
         return_date BETWEEN '2005-05-29'
      AND '2005-05-30'
   );
```

#### Wynik
|film_id|title|
|-|-|
|307|Fellowship Autumn|
|255|Driving Polish|
|388|Gunfight Moon|
|130|Celebrity Horn|
|563|Massacre Usual|
|397|Hanky October|
|...|...|

### Używanie podzapytań

Pod zapytania mogą być używane w :
- SELECT,
- UPDATE,
- DELETE,
- Funkcjach agregujących,
- Do definiowania tabel tymczasowych.

Używając podzapytań zapytania SQL szybko mogą stać się mało czytelne. Przez co będą trudne w zrozumieniu i późniejszym utrzymaniu. W celu analizy zapytań można użyć klauzuli __EXPLAIN__, która przeanalizuje zapytanie. Klauzula ta może służyć również do porównywania wydajności zapytań

#### Przykład:
```sql
EXPLAIN SELECT
   *
FROM
   film
```

## Funkcje agregujące

Funkcje agregujące wykonują obliczenia na zestawie wierszy i zwracają pojedynczy wiersz. PostgreSQL udostępnia wszystkie standardowe funkcje agregujące SQL w następujący sposób:
- AVG () - zwraca średnią wartość.
- COUNT () - zwraca liczbę wartości.
- MAX () - zwraca maksymalną wartość.
- MIN () - zwraca minimalną wartość.
- SUM () - zwraca sumę wszystkich lub różnych wartości.

Pełna lista funkcji agregującej: https://www.postgresql.org/docs/9.5/functions-aggregate.html

Często używamy funkcji agregujących z klauzulą GROUP BY w instrukcji SELECT. W tych przypadkach klauzula GROUP BY dzieli zestaw wyników na grupy wierszy i funkcja agregująca wykonuje obliczenia dla każdej grupy, np. maksimum, minimum, średnia itp. Funkcji agregujących można używać funkcji agregujących jako wyrażeń tylko w następujących klauzulach: SELECT i HAVING.

### GROUP BY
Klauzula GROUP BY dzieli wiersze zwrócone z instrukcji SELECT na grupy. Dla  każdej grupy można zastosować funkcję agregującą, np. SUM aby obliczyć sumę pozycji lub
COUNT aby uzyskać liczbę elementów w grupach.

Poniższa instrukcja ilustruje składnię klauzuli GROUP BY:
```sql
SELECT 
    column_1, 
    aggregate_function(column_2)
FROM 
    tbl_name
GROUP BY 
    column_1;
```
Klauzula GROUP BY musi pojawić się zaraz po klauzuli FROM lub WHERE, n0astępnie GROUP BY zawiera listę  kolumna oddzielonych przecinkami. 

### HAVING
Często używamy klauzuli HAVING w połączeniu z klauzulą GROUP BY do filtrowania wierszy grup
które nie spełniają określonego warunku.

Poniższa instrukcja ilustruje typową składnię klauzuli HAVING:
```sql
SELECT
    column_1,
    aggregate_function (column_2)
FROM
    tbl_name
GROUP BY
    column_1
HAVING
    condition;
```
Klauzula HAVING ustawia warunek dla wierszy grup utworzonych przez klauzulę GROUP BY.  

Klauzula GROUP BY ma zastosowanie, podczas gdy klauzula WHERE określa wcześniej warunki dla poszczególnych wierszy.

## Zadania wprowadzające
Wykonaj zapytania przy użyciu DBMS:  
  
1. Znajdź listę wszystkich filmów o tej samej długości.
2. Znajdź wszystkich klientów mieszkających w tym samym mieście.
3. Oblicz średni koszt wypożyczenia wszystkich filmów.
4. Oblicz i wyświetl liczbę filmów we wszystkich kategoriach.
5. Wyświetl liczbę wszystkich klientów pogrupowanych według kraju.
6. Wyświetl informacje o sklepie, który ma więcej niż 100 klientów i mniej niż 300 klientów.
7. Wybierz wszystkich klientów, którzy oglądali filmy ponad 200 godzin.
8. Oblicz średnią wartość wypożyczenia filmu.
9. Oblicz średnią wartość długości filmu we wszystkich kategoriach.
10. Znajdź najdłuższe tytuły filmowe we wszystkich kategoriach.
11. Znajdź najdłuższy film we wszystkich kategoriach. Porównaj wynik z pkt 10.

In [506]:
import numpy as np
import pickle

import psycopg2 as pg
import pandas.io.sql as psql
import pandas as pd

from typing import Union, List, Tuple

from sqlalchemy import create_engine

# connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020');
db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"
db = create_engine(db_string)
connection = db.connect()

**Zadanie 1**

In [507]:
df = pd.read_sql("SELECT length, COUNT(length) FROM film "
                 "GROUP BY length", con=connection)
df

     length  count
0       116      4
1       184      8
2        87      6
3        71      7
4        68      5
..      ...    ...
135     148      7
136     129      7
137     130      6
138     143      7
139      58      7

[140 rows x 2 columns]

**Zadanie 2**

In [508]:
df = pd.read_sql("SELECT cu.first_name, cu.last_name, ci.city FROM customer AS cu "
                 "INNER JOIN address AS ad ON ad.address_id = cu.address_id "
                 "INNER JOIN city AS ci ON ci.city_id = ad.city_id "
                 "WHERE ci.city_id IN (SELECT ci.city_id FROM customer AS cu "
                 "INNER JOIN address AS ad ON ad.address_id = cu.address_id "
                 "INNER JOIN city AS ci ON ci.city_id = ad.city_id "
                 "GROUP BY ci.city_id HAVING COUNT(*) > 1)", con=connection)
df

  first_name last_name    city
0     Mattie   Hoffman  London
1      Scott   Shelley  Aurora
2      Cecil     Vines  London
3    Clinton    Buford  Aurora

**Zadanie 3**

In [509]:
df = pd.read_sql("SELECT AVG(payment.amount) FROM payment", con=connection)
df

        avg
0  4.200606

**Zadanie 4**

In [510]:
df = pd.read_sql("SELECT name, COUNT(name) FROM category AS ca "
                 "INNER JOIN film_category AS fc ON fc.category_id = ca.category_id "
                 "GROUP BY name", con=connection)
df

           name  count
0        Sports     74
1      Classics     57
2           New     63
3        Family     69
4        Comedy     58
5     Animation     66
6        Travel     57
7         Music     51
8         Drama     62
9        Horror     56
10       Sci-Fi     61
11        Games     61
12  Documentary     68
13      Foreign     73
14       Action     64
15     Children     60

**Zadanie 5**

In [511]:
df = pd.read_sql("SELECT co.country, COUNT(co.country) FROM customer AS cu "
                 "INNER JOIN address AS ad ON ad.address_id = cu.address_id "
                 "INNER JOIN city AS ci ON ci.city_id = ad.city_id "
                 "INNER JOIN country AS co ON co.country_id = ci.country_id "
                 "GROUP BY co.country ", con=connection)
df

                  country  count
0              Bangladesh      3
1               Indonesia     14
2               Venezuela      7
3                Cameroon      2
4          Czech Republic      1
..                    ...    ...
103              Tanzania      3
104                Poland      8
105             Greenland      1
106         French Guiana      1
107  Virgin Islands, U.S.      1

[108 rows x 2 columns]

**Zadanie 6**

In [512]:
df = pd.read_sql("SELECT * FROM store AS st "
                 "WHERE st.store_id IN (SELECT st.store_id FROM customer AS cu "
                 "INNER JOIN store AS st ON st.store_id = cu.store_id "
                 "GROUP BY st.store_id HAVING COUNT(st.store_id) BETWEEN 100 AND 300)", con=connection)
df

   store_id  manager_staff_id  address_id         last_update
0         2                 2           2 2006-02-15 09:57:12

**Zadanie 7**

In [513]:
df = pd.read_sql("SELECT * FROM customer AS cu "
                 "WHERE cu.customer_id IN (SELECT cu.customer_id FROM customer AS cu "
                 "INNER JOIN rental AS re ON re.customer_id = cu.customer_id "
                 "INNER JOIN inventory AS inv ON inv.inventory_id = re.inventory_id "
                 "INNER JOIN film AS fi ON fi.film_id = inv.film_id "
                 "GROUP BY cu.customer_id HAVING SUM(fi.length) > 12000)", con=connection)
df

Empty DataFrame
Columns: [customer_id, store_id, first_name, last_name, email, address_id, activebool, create_date, last_update, active]
Index: []

**Zadanie 8**

In [514]:
df = pd.read_sql("SELECT fi.title, AVG(pa.amount) FROM payment AS pa "
                 "INNER JOIN rental AS re ON re.rental_id = pa.rental_id "
                 "INNER JOIN inventory AS inv ON inv.inventory_id = re.inventory_id "
                 "INNER JOIN film AS fi ON fi.film_id = inv.film_id "
                 "GROUP BY fi.title", con=connection)
df

                     title       avg
0       Graceland Dynamite  6.323333
1                 Opus Ice  6.090000
2         Braveheart Human  3.390000
3           Wonderful Drop  5.865000
4          Rush Goodfellas  2.918571
..                     ...       ...
953  Mockingbird Hollywood  2.444545
954     Gathering Calendar  1.990000
955         Drums Dynamite  1.913077
956           Samurai Lion  4.240000
957           Pond Seattle  3.434444

[958 rows x 2 columns]

**Zadanie 9**

In [515]:
df = pd.read_sql("SELECT ca.name, AVG(fi.length) FROM film AS fi "
                 "INNER JOIN film_category AS fc ON fc.film_id = fi.film_id "
                 "INNER JOIN category AS ca ON ca.category_id = fc.category_id "
                 "GROUP BY ca.name", con=connection)
df

           name         avg
0        Sports  128.202703
1      Classics  111.666667
2           New  111.126984
3        Family  114.782609
4        Comedy  115.827586
5     Animation  111.015152
6        Travel  113.315789
7         Music  113.647059
8         Drama  120.838710
9        Horror  112.482143
10       Sci-Fi  108.196721
11        Games  127.836066
12  Documentary  108.750000
13      Foreign  121.698630
14       Action  111.609375
15     Children  109.800000

**Zadanie 10**

In [516]:
df = pd.read_sql("SELECT ca.name, MAX(length) FROM film AS fi "
                 "INNER JOIN film_category AS fc ON fc.film_id = fi.film_id "
                 "INNER JOIN category AS ca ON ca.category_id = fc.category_id "
                 "GROUP BY ca.name ", con=connection)
df

           name  max
0        Sports  184
1      Classics  184
2           New  183
3        Family  184
4        Comedy  185
5     Animation  185
6        Travel  185
7         Music  185
8         Drama  181
9        Horror  181
10       Sci-Fi  185
11        Games  185
12  Documentary  183
13      Foreign  184
14       Action  185
15     Children  178

**Zadanie 11**

In [517]:
df = pd.read_sql("SELECT fi.title, ca.name, fi.length FROM film AS fi "
                 "INNER JOIN film_category AS fc ON fc.film_id = fi.film_id "
                 "INNER JOIN category AS ca ON ca.category_id = fc.category_id "
                 "WHERE fi.length = (SELECT MAX(length) FROM film)", con=connection)
df

                title       name  length
0       Chicago North      Games     185
1      Control Anthem     Comedy     185
2      Darn Forrester     Action     185
3         Gangs Pride  Animation     185
4           Home Pity      Music     185
5       Muscle Bright     Travel     185
6        Pond Seattle  Animation     185
7  Soldiers Evolution     Sci-Fi     185
8   Sweet Brotherhood     Travel     185
9        Worst Banger     Action     185

## Zadanie implementacyjne
Zaimplementuj wszystkie funkcje w pliku main.py zgodnie z opisem a następnie przetestuj je w notatniku.

In [518]:
import main

**Zadanie 1 -> 'film_in_category'**

In [519]:
main.film_in_category(10)

                    title               languge category
0             Autumn Crow  English                 Games
1   Bulworth Commandments  English                 Games
2          Candles Grapes  English                 Games
3           Chicago North  English                 Games
4   Creatures Shakespeare  English                 Games
..                    ...                   ...      ...
56            Vanilla Day  English                 Games
57      Videotape Arsenic  English                 Games
58          Volcano Texas  English                 Games
59          Wanda Chamber  English                 Games
60           Wind Phantom  English                 Games

[61 rows x 3 columns]

**Zadanie 2 -> 'number_films_in_category'**

In [520]:
main.number_films_in_category(10)

  category  count
0    Games     61

**Zadanie 3 -> 'number_film_by_length'**

In [521]:
main.number_film_by_length(50,60)

    length  count
0       50      9
1       51      7
2       52      7
3       53      9
4       54      6
5       55      2
6       56      5
7       57      7
8       58      7
9       59      9
10      60      8

**Zadanie 4 -> 'client_from_city'**

In [522]:
main.client_from_city('Athenai')

      city first_name last_name
0  Athenai      Linda  Williams

**Zadanie 5 -> 'avg_amount_by_length'**

In [523]:
main.avg_amount_by_length(48)

   length       avg
0      48  4.295389

**Zadanie 6 -> 'client_by_sum_length'**

In [524]:
main.client_by_sum_length(1000)

    first_name last_name   sum
0        Brian     Wyman  1265
1      Antonio      Meek  1451
2        Leona    Obrien  1588
3    Katherine    Rivera  1615
4      Tiffany    Jordan  1667
..         ...       ...   ...
594     Wesley      Bull  4808
595      Clara      Shaw  4808
596      Tammy   Sanders  5065
597    Eleanor      Hunt  5360
598       Karl      Seal  5388

[599 rows x 3 columns]

**Zadanie 7 -> 'category_statistic_length'**

In [525]:
main.category_statistic_length('Action')

  category         avg   sum  min  max
0   Action  111.609375  7143   47  185